import Style from './privacy.module.css'

import Heading from '../Heading';
function Privacy(){
    return (
        <div className={Style.privacy}>


        <Heading massage="Політика конфіденційності"/>

        





        <div className={Style.content}>
            <h2>Політика використання файлів «cookies»</h2>
            <p>Політика використання файлів «cookies» ліцею «Оріяна» серйозно ставиться до обробки Ваших персональних даних, питань безпеки та конфіденційності оброблюваних персональних даних. Дана Політика використання файлів «cookies» (далі - «Політика») прийнята ліцеєм «Оріяна» (м. Львів, вул. Чукаріна, 3) (далі - «Компанія») і діє відносно файлів «cookies» Відвідувача, які Компанія може отримати через сайт oriyana-school.pp.ua (далі - «Сайт»), з будь-якого пристрою і при комунікації з Компанією в будь-якій формі. Дана Політика використання файлів «cookies» визначає порядок і умови обробки файлів «cookies», що збираються за допомогою Сайту.
1. З метою поліпшення роботи Сайту, підвищення зручності та ефективності роботи Відвідувача з Сайтом, надання рішень та послуг, які найбільш відповідають потребам Відвідувача Сайту, визначення переваг Відвідувача, відображення рекламних оголошень (поведінкової реклами), а також для забезпечення технічної можливості функціонування Сайту Компанії необхідно зберігати і накопичувати інформацію про те, як Відвідувач Сайту використовує даний Сайт. Для цього використовуються невеликі за розміром текстові файли, які називаються «cookies». «Cookies» містять невеликі обсяги інформації і завантажуються на комп'ютер Відвідувача Сайту або інший пристрій з сервера Сайту Компанії. Більш детальну інформацію про «cookies» та принципи їх роботи можна знайти на ресурсі http://www.aboutcookies.org/ (звертаємо увагу Відвідувачів Сайту, що Компанія не пов'язана з цим стороннім веб-сайтом і не несе відповідальність за його вміст).
<br></br><br></br>
2. Коли Відвідувач заходить на Сайт, Компанія використовує декілька програм (систем), які можуть встановлювати файли «cookies», теги, пікселі і аналогічні технології відстеження (спільно іменовані файли «cookies») на пристрої Відвідувача Сайту, в браузері або на веб-сторінці, що переглядається Відвідувачем Сайту, з метою персоналізації налаштувань (наприклад, мовні переваги) Відвідувача Сайту, забезпечення розуміння характеру використання, надання, поліпшення і захисту Сайту.
<br></br><br></br>
3. Сайт використовує різні типи файлів «cookies» для різних цілей, а саме:
<br></br><br></br>
3.1. Абсолютно необхідні файли «cookies»: дані файли «cookies» необхідні для того, щоб Відвідувач Сайту міг переміщатися по Сайту і використовувати його функції. Без таких файлів неможливо використовувати основний функціонал Сайту
<br></br><br></br>
3.2. Експлуатаційні файли «cookies»: дані файли «cookies» збирають інформацію про те, як Відвідувач Сайту використовує Сайт. Зібрана інформація включає, наприклад, використовувані браузери і операційні системи, доменне ім'я раніше відвіданого веб-сайту, кількість відвідувань, середню тривалість відвідування та переглянуті сторінки. Такі файли «cookies» не збирають інформацію, яка ідентифікує Відвідувача Сайту особисто, і укрупнені дані (дані, зібрані і виражені в узагальненому вигляді для цілей статистичного аналізу і не є персональними даними відповідно до чинного законодавства). Експлуатаційні файли «cookies» використовуються для підвищення зручності користування Сайтом і підвищення ступеня задоволеності Відвідувача Сайту роботою Сайту.
<br></br><br></br>
3.3. Функціональні файли «cookies»: дані файли «cookies» дозволяють Сайту запам'ятовувати вибрані Відвідувачем Сайту варіанти (наприклад, ім'я Відвідувача Сайту або мережевий ідентифікатор (ID), мовні настройки або область або регіон, в якому знаходиться Відвідувач Сайту) і надають розширені, більш персоналізовані функції Сайту. Ці файли «cookies» також можна використовувати для запам'ятовування змін, внесених Відвідувачем Сайту в розмір тексту, шрифти та інші частини веб-сторінок, що настроюються. Інформацію, яку збирають такі файли «cookies», можливо знеособити; дані файли «cookies» не можуть відстежувати активність Відвідувача Сайту на інших сайтах.
<br></br><br></br>
4. Користуючись Сайтом, Відвідувач Сайту погоджується на те, що Компанія може використовувати експлуатаційні і перенапраямні файли «cookies» сторонніх сервісів, таких як метричні програми (системи) Яндекс.Метрика, Google Analytics, Google Tag Manager, Facebook Pixel, Amplitude, Hotjar тощо для збору інформації про онлайн- дії Відвідувача Сайту на Сайті. Така інформація використовується для відображення рекламних оголошень з урахуванням інтересів Відвідувача Сайту (поведінкова реклама), а також для збору інформації, яка допомагає відслідковувати і керувати ефективністю рекламних оголошень і кількістю відвідувачів. Це означає, що Компанія може показувати рекламні оголошення виходячи з минулих відвідувань Сайту через видавничі мережі, такі як Google Display Network (GDN). З додатковою інформацією про такі файли «cookies» можна ознайомитися на веб-сайті відповідної третьої сторони (http://www.google.com/settings/ads/).
Відвідувач Сайту також може отримати більше інформації про певні рекламні оголошення (поведінкова реклама) і відмову від них, відвідавши такі сайти: Digital Advertising Alliance-US, Network Advertising Initiative, Digital Advertising Alliance-Canada, European Interactive Digital Advertising Alliance, www.allaboutcookies.org або налаштування пристрою Відвідувача Сайту для мобільного застосування Сайту. Відвідувач Сайту також може змінити налаштування реклами в мережі Google Display Network або відмовитися від них за адресою :http://www.google.com/settings/ads/.
<br></br><br></br>
5. Якщо Відвідувач Сайту не згоден з деякими видами використання файлів «cookies», описаними вище, Відвідувач Сайту може скористатися налаштуваннями свого браузера або не використовувати Сайт. Якщо Відвідувач Сайту вирішить відмовитися від використання файлів «cookies» через настройки браузера, Відвідувач Сайту все одно зможе використовувати Сайт, хоча доступ Відвідувача Сайту до деяких функцій і веб-сторінок Сайту може бути обмежений. Оскільки засоби, за допомогою яких Відвідувач Сайту може відмовитися від збору Компанією файлів «cookies» через елементи управління браузера, відрізняються в залежності від браузера, для отримання додаткової інформації Відвідувачу Сайту слід звернутися до меню довідки браузера, використовуваного Відвідувачем Сайту.
<br></br><br></br>
5.1. Інформація про те, як змінювати налаштування файлів «cookies» в браузері Google Chrome, доступна на ресурсі :https://support.google.com/chrome/answer/95647?hl=en
<br></br><br></br>
5.2. Інформація про те, як змінювати налаштування файлів «cookies» в браузері Microsoft Internet Explorer, доступна на ресурсі: https://support.microsoft.com/en-us/help/278835/how-to-delete-cookie-files-in-internet-explorer
<br></br><br></br>
5.3. Інформація про те, як змінювати налаштування файлів «cookies» в браузері Mozilla Firefox, доступна на ресурсі: https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored
<br></br><br></br>
5.4. Інформація про те, як змінити налаштування «cookies» в браузері Apple Safari, доступна на ресурсі: https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac
<br></br><br></br>
5.5. Інформація про інші браузери і типи пристроїв міститься на сайті https://www.aboutcookies.org/ (звертаємо увагу Відвідувачів Сайту, що Компанія не пов'язана з цим стороннім веб-сайтом, а також веб-сайтами, зазначеними в пп. 5.1 – 5.4 цієї Політики, і не несе відповідальність за їх вміст).
<br></br><br></br>
6. Відвідувач Сайту повинен враховувати, що в даний час Сайт не налаштований для обробки сигналів браузера «Не відстежувати».
<br></br><br></br>
7. На власний розсуд Компанія може періодично вносити зміни або доповнення до даної Політики. Компанія закликає Відвідувачів Сайту періодично перечитувати цю Політику для ознайомлення зі способами використання файлів «cookies».
<br></br><br></br>
8. При внесенні змін в актуальній редакції Політики вказується дата останнього оновлення. Нова редакція Політики набирає чинності з моменту її розміщення на Сайті, якщо інше не передбачено новою редакцією Політики. Продовжуючи користуватися Сайтом Відвідувач Сайту підтверджує згоду з внесеними змінами і доповненнями в Політику.
<br></br><br></br>
9. Чинна редакція Політики постійно доступна на сторінці за адресою: oriyana-school.pp.ua/privacypolicy</p>
        

        <h2>Згода на обробку та передачу третім особам персональних даних</h2>
        <p>Ліцей «Оріяна» створили цю Політику конфіденційності відповідно до зобов’язань щодо вашої конфіденційності на веб-сайтах і в маркетингових ініціативах ліцею «Оріяна».
Нижче описано методи збору, розповсюдження та захисту інформації ліцею «Оріяна». Якщо ви не згодні з умовами цієї Політики конфіденційності, будь ласка, не відвідуйте та не використовуйте веб-сайти ліцею «Оріяна».
<br></br>
<br></br>
Заповнюючи форму зворотнього звʼязку на сайті ліцею «Оріяна» (надалі – «Сайт»), я відповідно до Закону України «Про захист персональних даних» від 01.06.2010 № 2297-VI (далі — Закон № 2297) надаю ліцею «Оріяна»: вулиця Чукаріна, 3, Львів, Львівська область, 79000 (володар персональних даних) добровільну та інформовану згоду на обробку моїх персональних даних, зазначених у формі, на наступних умовах:
Виходячи з мети обробки персональних даних, зазначеної в пункті 2 цієї згоди, склад моїх персональних даних, дозвіл на обробку яких надається мною в даної згоді, є таким: ПІБ субʼєкта, контактні дані і відомості про активність на Сайті, в тому числі номер телефону (службовий, мобільний), IP-адреси пристроїв, що використовуються Суб'єктом в ході взаємодії з ліцеєм «Оріяна», їх моделі, історія браузера, тип пристрою, тип операційної системи і комп'ютера, мобільного браузера, файли «cookies», відомості про дії на Сайті , дата і час відвідування Сайту (сесії), оновлення та видалення даних, в т.ч. з використанням метричних програм Google Analytics та інших;</p>

        <h3>Мета з якою оброблятимуться персональні дані</h3>
        <p>Метою обробки персональних даних є встановлення зворотнього зв'язку з Суб'єктом. IP-адреси пристроїв, за допомогою яких відвідується Сайт, історія браузера, тип пристрою, тип операційної системи і комп'ютера, мобільного браузера, дата і час відвідування Сайту (сесії), оновлення та видалення даних, відомості про дії на Сайті (в тому числі про перегляд рекламі, використання сервісів Сайту), файли «cookies» обробляються з метою поліпшення роботи Сайту, підвищення зручності та ефективності роботи з Сайтом, надання рішень і послуг, що найбільш відповідають потребам Суб'єкта, визначення його переваг, відображення рекламних оголошень (поведінкової реклами), надання цільової інформації щодо послуг ліцею “Оріяна”, надання Суб'єкту таргетованої реклами на основі переваг / дій суб'єкта на Сайті за допомогою сервісів Facebook, Instagram, а також для забезпечення технічної можливості функціонування Сайту.</p>

        <h3>Захист ваших особистих даних</h3>
        <p>Ваші дані зберігаються у дата-центрі у Франкфурті. Це сторонній дата-центр (Amazon Web Services), в якому ліцей «Оріяна» орендує сервіси та хостинг.<br></br>
Всі дані захищені відповідною Політикою конфіденційності даних AWS, яка включає, але не обмежується:<ul>
<li>Підтримка широкого спектру програм з дотримання вимог, що підтверджують контроль безпеки.</li>
<li>Ми захищаємо безпеку вашої інформації під час передачі на веб-сайти, програми, продукти чи послуги AWS або з них, використовуючи протоколи шифрування та програмне забезпечення.</li>
<li>Підтримка протоколів безпеки для збору, зберігання та передачі електронних даних пов’язаних з особистою інформацією.</li></ul>
Місце (Фактична Адреса) обробки персональних даних: вулиця Чукаріна, 3, Львів, Львівська область, 79000
</p>

        <h3>Права суб'єкта</h3>
        <p>Я до моменту надання цієї згоди ознайомлений зі своїми правами, передбаченими Законом № 2297, а саме:<ul>
<li>знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження та / або місце проживання (перебування) власника чи розпорядника персональних даних або дати відповідне доручення щодо отримання цієї інформації уповноваженим мною особам, крім випадків, встановлених Законом;</li>

<li>отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб, яким передаються мої персональні дані;</li>
<li>на доступ до своїх персональних даних;</li>
<li>отримувати не пізніше як за 30 календарних днів з дня надходження запиту, крім випадків, передбачених законом, відповідь про те, чи обробляються мої персональні дані, а також отримувати зміст таких персональних даних;</li>
<li>пред’являти власнику персональних даних вмотивовану вимогу із запереченням проти обробки своїх персональних даних;</li>
<li>пред’являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким власником та розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними;</li>
<li>на захист своїх персональних даних від незаконної обробки та випадкових втрат, знищення, пошкодження у зв’язку з умисним приховуванням, ненаданням або несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;</li>
<li>звертатися із скаргами на обробку своїх персональних даних до органів державної влади та посадових осіб, до Уповноваженого Верховної Ради України з прав людини або до суду;</li>
<li>застосовувати засоби правового захисту у разі порушення законодавства про захист персональних даних;</li>
<li>вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;</li>
<li>відкликати згоду на обробку персональних даних;</li>
<li>знати механізм автоматичної обробки персональних даних;</li>
<li>на захист від автоматизованого рішення, яке має для мені правові наслідки.</li></ul></p>

</div>








        </div>
    )
}


export default Privacy