import Style from "./index.module.css"
import Heading from "../Heading"
import Vector from './assets/Vector.svg'
import Facebook from './assets/Facebook.svg'
import React from 'react';
function FreeTime(){
    const Free = <div className={Style.free}>Безкоштовно</div>
    const paid = <div className={Style.paid}>Платно</div>

    const activities = [
        {
          name: `Шахи від "Львівської шахової академії"`,
          description:`Разом з грою у шахи діти розвивають стратегічне мислення і покращують шахові навички під керівництвом висококваліфікованих тренерів. Грати в шахи - це чудовий спосіб вдосконалювати пам'ять, увагу та вміння приймати рішення.`,
          ageGroup: {
            "1-2 класи": ["Понеділок 15:30-20:30","Вівторок 15:30-20:30","Четвер 15:30-20:30"],

          },
          
          instructor: "Сергій Мельник",
          contact: "(067) 213 44 54",
          price: paid
        },
        {
          name: `Гурток малювання “Палітра”`,
          description:`"Палітра" відкриває світ мистецтва та креативності через роботу з різноманітними малюнками та техніками. Діти вчаться виражати свої ідеї на полотні та розвивають свій художній потенціал.`,
          ageGroup: {
            "1-2 класи": ["Понеділок 15:00-16:00 "],
            "3-4 класи": ["Вівторок 15:00-16:00"],
            "5-6 класи": ["Четвер 15:00-16:00"]
          },
          instructor: "Олена Кравець",
          contact: "(066) 942 12 33",
          price: Free
        },
        {
          name: `Ансамбль танцю "Сихівчани"`,
          description: `"Сихівчани" - не просто танцювальний гурток, а справжня команда, що об'єднує талановитих та енергійних учасників. Приєднуйтеся до нас, щоб разом створювати неповторні виступи.`,
          ageGroup: {
            "1-8 класи": ["Вівторок 15:00-16:00","Середа 15:00-16:00", "Пʼятниця 15:00-16:00"]
          },
          instructor: "Олексій Коваль",
          contact: "(098) 616 68 25",
          price: Free
        },
      {
        name: `Сучасні танці JUZZ FUNK`,
          description: `Заняття сучасними танцями включають в себе роботу над технікою, координацією та власним стилем. Діти вчаться відчувати музику, втілювати хореографічні композиції та, при цьому, розвиваються фізично.`,
          ageGroup: {
            "1-5 класи (1 група)": ["Понеділок 15:00-16:00 ","Середа 15:00-16:00", "Пʼятниця 15:00-16:00"],
            "1-5 класи (2 група)": ["Понеділок 17:00-18:00 ","Середа 17:00-18:00", "Пʼятниця 17:00-18:00"]
          },
          instructor: "Христина Шевченко",
          contact: "(063) 070-32-02",
          price: paid
        },
        {
          name: `Бальні танці`,
            description: `Класичні та латиноамериканські танці розвивають витривалість, гнучкість, а також вчать взаємодіяти з партнером чи партнеркою.`,
            ageGroup: {
              "1-5 класи": ["Вівторок 16:00-17:00", "Четвер 16:00-17:00"]
            },
            instructor: "Дмитро Керницький",
            contact: "(097) 139-87-03",
            price: paid
          },
          {
            name: `Спортивно-танцювальний клуб DFA`,
              description: `Dance Family Adagio + AnDance поєднує в собі бальні танці, hip hop, сучасну хореографію та східні танці.`,
              ageGroup: {
                "1-5 класи": ["Вівторок 17:00-18:00", "Четвер 17:00-18:00"]
              },
              instructor: "Дмитро Керницький",
              contact: "(097) 139-87-03",
              price: paid
            },
            {
              name: `Художня гімнастика для дівчаток`,
                description: `Художня гімнастика - це поєднання спорту і мистецтва. Заняття розвивають відчуття ритму, виразність та естетику рухів.`,
                ageGroup: {
                  "З 3-ох років": ["Понеділок-субота 16:00-20:30"]
                },
                instructor: "Ірина Мороз",
                contact: "(067) 297 22 65",
                price: paid
              }, 
              {
            name: `Футбол`,
              description: `Діти зможуть розвинути свою фізичну форму, водночас вивчаючи основні тактичні та технічні елементи гри, а також навчитися взаємодіяти на полі з іншими гравцями.`,
              ageGroup: {
                "5-14 років": ["Понеділок 15:00-18:00", "Середа 15:00-18:00","Пʼятниця 15:00-18:00","Субота 15:00-18:00"]
              },
              instructor: "Віра Степаненко",
              contact: "(097) 664 20 83",
              price: Free
            },
            {
              name: `Футбол. Футбольний клуб "Чайка"`,
                description: `Футбольний клуб покликаний привити любов до професійного спорту, навчити підтримувати командний дух та брати участь у змаганнях різної складності.`,
                ageGroup: {
                  "5-14 років": ["Вівторок 15:30-16:30", "Четвер 15:30-16:30","Субота 10:00-11:00"]
                },
                instructor: "Ігор Сидорчук",
                contact: "(067) 944-40-13",
                price: paid
              },
            {
              name: `Бойовий гопак`,
                description: `Запрошуємо приєднатися до вивчення бойового гопака - українського бойового мистецтва, створеного на основі традиційного козацького бою, що передавалося через покоління у танці.`,
                ageGroup: {
                  "З 6-ти років": ["Понеділок 18:00-20:30", "Середа 18:00-20:30","Пʼятниця 18:00-20:30"]
                },
                instructor: "Тарас Литовченко",
                contact: "(093) 447 77 90",
                price: paid
              },
              {
              name: `Підготовка до школи (дошкільнята)`,
                description: `За допомогою ігрового методу, ми навчаємо дошкільнят читанню, рахуванню та письму з нуля. Також дитина тренуватиме свою памʼять, моторику та посидючість ще до вступу в 1 клас.`,
                ageGroup: {
                  "5-6 років": ["Вівторок-пʼятниця"]
                },
                instructor: "Наталя Ткаченко",
                contact: "(098) 235 64 57",
                price: paid
              },

              {
                name: `Малі форми вокалу`,
                  description: `Тут учні матимуть можливість розкрити свій музичний талант та вивчити основи вокальної майстерності в різних музичних жанрах.`,
                  ageGroup: {
                    "5-10 класи": ["Понеділок 14:55-16:30","Вівторок 16:35-18:40", "Середа 15:05-16:30","Четвер 16:35-18:40"]
                  },
                  instructor: "Олег",
                  contact: "(096) 543 57 69",
                  price: Free
                },


                {
                  name: `Інструментальний ансамбль`,
                    description: `Приєднуйтеся до інструментального ансамблю та вивчайте улюблений інструмент, створюючи разом чарівні мелодії.`,
                    ageGroup: {
                      "5-9 класи": ["Понеділок 16:35-18:10", "Середа 16:35-18:10",]
                    },
                    instructor: "Олег Данилюк",
                    contact: "(096) 543 57 69",
                    price: Free
                  },
                  {
                    name: `Молодіжний вокальний ансамбль`,
                      description: `Молодіжний вокальний ансамбль - це можливість для кожного і кожної проявляти свій вокальний талант, тренувати голос та брати участь у створенні вокальних композицій.`,
                      ageGroup: {
                        "9-11 класи": ["Вівторок 14:55-16:30", "Четвер 14:55-16:30",]
                      },
                      instructor: "Олег Данилюк",
                      contact: "(096) 543 57 69",
                      price: Free
                    },
                    {
                      name: `Англійська мова "Компас"`,
                        description: `Додаткові заняття з англійської мови для всіх класів - не проблема. Гурток допомагає учням суттєво покращувати їхні навички читання, письма, слухання та розмови англійською мовою.`,
                        ageGroup: {
                          "1-11 класи": ["Вівторок 14:00-19:30", "Четвер 14:00-19:30","Пʼятниця 14:00-19:30"]
                        },
                        instructor: "Зоряна Гончаренко",
                        contact: "(063) 807 88 91",
                        price: paid
                      },
                      {
                        name: `Бісероплетіння`,
                          description: `На заняттях з бісероплетіння розвиваєтсья креативність, творче мислення та моторика рук через виготовлення різноманітних прикрас та виробів.`,
                          ageGroup: {
                            "1-9 класи": ["Вівторок 15:30-19:30", "Четвер 15:30-19:30"]
                          },
                          instructor: "Божена Петрів",
                          contact: "(096) 336 76 96",
                          price: Free
                        },
      ];

      

    return(
        <div className={Style.freeTime}>
            <Heading massage="Дозвілля"/>
            <div>
              
  

{activities.map((item, key) => (
  <div className={Style.container} key={key}>
    <div className={Style.description}>
      <div className={Style.description1}>
        <h3>{item.name}</h3> {item.price}
      </div>
      <p>{item.description}</p>
    </div>
    <div className={Style.time}>
      {Object.entries(item.ageGroup).map(([ageGroup, daysAndTimes]) => (
        <div key={ageGroup}>
          <h4>{ageGroup}</h4>
          {daysAndTimes.map((dayAndTime, idx) => (
            <React.Fragment key={idx}>

              <div className={Style.time1}>
              <span ><p className={Style.timeSlot}>{dayAndTime.split(" ")[0]} </p></span> <span className={Style.weight }><p>{dayAndTime.split(" ")[1]}</p></span>
             
              </div>
  
            </React.Fragment>
          ))}
        </div>
      ))}
    </div>
    <div className={Style.contacts}>
      <div className={Style.Facebook}>
        <img src={Facebook} alt="Facebook" />
        <p>{item.instructor}</p>
      </div>
      <div className={Style.Number}>
        <img src={Vector} alt="Vector" />
        <p>{item.contact}</p>
      </div>
    </div>
  </div>
))}

            </div>
            

                
        </div>
    );
}

export default FreeTime