import Style from './index.module.css'
import Heading from '../Heading'

import link from './assets/Link.svg'
import Newtab from './assets/Newtab.svg'
import img1 from './assets/image4.jpg'
import img2 from './assets/image6.jpg'

function meal(){
return(
    <div className={Style.meal}>
        <Heading massage="Харчування"/>
        <p>Харчування відіграє серйозну роль в питанні повноцінного розвитку і зростання школярів. Воно не тільки сприяє загальному зміцненню організму дітей, але також може впливати на їхню працездатність і успішність. Достатня кількість поживних речовин і правильна культура споживання їжі не лише вберігають дитину від численних хвороб, а й роблять її бадьорішою і уважнішою.<br></br><br></br>
Раціональне харчування учнів будується на дотриманні трьох основних принципів:<br></br><br></br>

<ul><li>забезпечення відповідності енергетичної цінності раціону харчування енергозатратам організму;</li>
<li>задоволення фізіологічних потреб організму у визначеній кількості енергії і співвідношенні у харчових речовинах;</li>
<li>дотримання оптимального режиму харчування, тобто фізіологічно обґрунтованого розподілу кількості споживаної їжі протягом дня.</li></ul>
Їжа у школі має бути не тільки корисною, але й смачною і різноманітною. Тому в Україні розгорнуто реформу шкільного харчування. Новацій має зазнати не тільки склад шкільного меню та рецептури приготування, але й форми організації харчування, рекомендації до обладнання харчоблоків та роботи з постачальниками, а також підходи у формуванні культури здорового харчування у школярів, як наскрізної компетенції Нової української школи.</p>
<div className={Style.block}>
                        <div className={Style.leftSide}>
                            <img src={link}/>
                            <p>Примірне меню для харчування учнів в осінній період</p>

                        </div>
                        <img src={Newtab}/>
        </div>
        <div className={Style.block}>
                        <div className={Style.leftSide}>
                            <img src={link}/>
                            <p>Примірне меню для харчування учнів у зимово-весняний період</p>

                        </div>
                        <img src={Newtab}/>
        </div>

        <div className={Style.block}>
                        <div className={Style.leftSide}>
                            <img src={link}/>
                            <p>Результати проведеного опитування щодо якості харчування в ліцеї “Оріяна” ЛМР</p>

                        </div>
                        <img src={Newtab}/>
        </div>

        <div className={Style.imeges}>

            <img src={img1}/>
            <img src={img2}/>
        </div>




    </div>);


}


export default meal