import Style from './index.module.css'
import Heading from '../Heading'
import img1 from './assets/image2.webp'
import img2 from './assets/image3.webp'


function HistoryOfliceo(){
    return(
        <div className={Style.historyOfliceo}>
            <Heading massage="Історія ліцею"/>

            <p style={{ marginTop: "30px"}}>Навчально-виховний комплекс «Школа-ліцей «Оріяна» м. Львова створений у 2007 році ухвалою Львівської міської ради 6 сесії 5-го скликання №1112 від 05 07.2007р. “Про реорганізацію закладів освіти м. Львова” шляхом реорганізації школи-ліцею «Оріяна».</p>
        <p>Заклад нового типу Школа-ліцей «Оріяна» була утворена у 2001 році реорганізацією загальноосвітньої середньої школи №25 м. Львова ухвалою Львівської міської ради 13 сесії 3-го скликання №1119 від 21.06.2001 року.</p>
        <p>Загальноосвітня середня школа №25 м.Львова була створена у 1993 році розпорядженнями Львівської міської адміністрації від 07.05.93, №374 та від 03.09.93, №1006 . Будівництво школи розпочалось у 1991 році, тривало три роки. Школа будувалась для розвантаження сусідньої СШ№89 у якій у дві зміни навчались 3200 учнів. В перші роки у СШ №25 навчалось 1600 учнів у 54 класах.</p>
        <p>НВК «Школа-ліцей «Оріяна» знаходиться у комунальній власносності Львівської міської ради.Статут НВК затверджений наказом Управління освіти ЛМР від 20.08.2007, №2601-12/247.</p>
        <p>У квітні 2012р до Cтатуту внесені зміни. Ліцейні класи створюються з 8 класу.</p>
        <p>Заклад володіє земельною ділянкою 2,37 га відповідно до Ухвали ЛМР 11-тої сесії 5-го скликання від 23.10.2008 року, №2174.</p>
        <p>Право комунальної власності на будівлі навчального закладу затверджене рішенням виконавчого комітету ЛМР від 26.12.2008року, №1410 .</p>

<img src={img1} alt="" />

<p>1993 - Рік заснування СШ №25 м. Львова.</p>
<p>1998 - Створено клас фінансово-економічного профілю.</p>
<p>2000 - Участь у англо-українському проекті “Ділова активність”.</p>
<p>2001 - Заклад реорганізовано у школу-ліцей ”Оріяна”.</p>
<p>2002 - Драматичний театр “Світлячок” – лауреат обласного конкурсу огляду шкільних театральних колективів.</p>
<p>2003-2007 - I-III місяця у рейтингу шкіл Сихівського району та серед шкіл м.Львова за результатами Всеукраїнських предметних олімпіад.</p>
<p>2005 - Проведення літературно-мистецького свята “Я – патріот” у приміщенні КОЦ “Кіно” м. Львова.</p>
<p>2006 - Створено наукове учнівське товариство “Золотий Олімп”.</p>
<p>2001-2006 - Учителі школи-ліцею переможці і призери районного, міського таобласного конкурсів “Учитель року” у різних номінаціях.</p>
<p>2006 - Учасники міжнародного семінару з економіки (США-Україна). 2 місце в м.Львові за ІІ етап Всеукраїнських предметних олімпіад.</p>
<p>2007 - Ансамбль народного танцю “Сихівчани” – лауреат обласного туруВсеукраїнського фестивалю “Різдвяні канікули”, ”Галицькі барви”. 1 місце в м.Львові за ІІ етап Всеукраїнських предметних олімпіад. ВІА “Оріяни” призер обласного і учасник Всеукраїнського конкурсу “Сурми звитяги”.Заклад реорганізований у навчально-виховний комплекс.</p>
<p>2008 - Ансамбль народного танцю “Сихівчани” – лауреат обласного туруВсеукраїнського фестивалю “Різдвяні канікули”, ”Галицькі барви”. 3 місце в м.Львові за ІІ етап Всеукраїнських предметних олімпіад. ВІА “Оріяни” призер обласного і учасник Всеукраїнського конкурсу “Сурми звитяги”.Для громади Сихівського масиву учнями та вчителями поставлена літературно-мистецька вистава до 100-річчя від дня народження Ст. Бандери. Відкритий перший клас поглибленого вивчення англійської мови. Відкритий восьмий клас поглибленого вивчення інформатики. Спільний проект з НУ “Львівська Політехніка” з інформативних технологій.</p>
<p>2009 - Рекордна кількість переможців ІІ туру Всеукрраїнських предметних олімпіад – 35. Проведено ІІІ міський конкурс учнівських науково-пошукових робіт “Екологічні проблеми м. Львова та шляхи їх вирішення”.</p>
<p>2010 - Участь закладу у проекті «Енергоефективні школи» 2011, 2012 ІІ місце у міжнародному конкурсі «Енергія і середовище», Проводиться міський конкурс учнівських робіт «Екологічна оцінка навколишнього середовища західного регіону України».</p>
<p>2013 - Укладена угода з Львівським інститутом банківської справи НБУ.</p>
        <img src={img2}  />
        </div>
    );
}

export default HistoryOfliceo